Documents/ЗаказНаряд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказНаряд</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.МатериалыЗаказчиков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗаказовНарядов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроблемыЗаказчиком</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроблемыМастером</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличественныеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериалыЗаказчика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличественныеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеМатериала</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостояниеМатериаловКлиентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

HTTPServices/customerOrders/Ext/Module.bsl
Функция createOrderPOST(Запрос) 
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
	ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
	ЗапросПоиска = Новый Запрос;
	ЗапросПоиска.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка,
	|	Пользователи.Клиент КАК Клиент
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Код = &ВнешнийGUID";
	ЗапросПоиска.УстановитьПараметр("ВнешнийGUID", ДанныеЗапроса.GUIDПользователя);
	РезультатПоиска = ЗапросПоиска.Выполнить();
		
		Если Не РезультатПоиска.Пустой() Тогда
			Выборка = РезультатПоиска.Выбрать();
			Выборка.Следующий();
			НайденныйПользователь = Выборка.Ссылка;
		КонецЕсли;
	
	Если НайденныйПользователь = Справочники.Пользователи.ПустаяСсылка() Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		ТекстОшибки = "Пользователь с GUID " + ДанныеЗапроса.GUIDПользователя + " не найден в справочнике Пользователи";
		Ответ.УстановитьТелоИзСтроки(ТекстОшибки);
		Возврат Ответ;
	КонецЕсли;
	
	НоваяЗапись = Документы.ЗаказНаряд.СоздатьДокумент();
	НоваяЗапись.Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ДанныеЗапроса.Сотрудник);
	НоваяЗапись.Клиент = НайденныйПользователь.Клиент;
	НоваяЗапись.Дата = ТекущаяДата();
	НоваяЗапись.ДатаЗаписи = ПрочитатьДатуJSON(ДанныеЗапроса.ДатаЗаписи, ФорматДатыJSON.ISO);
	НоваяЗапись.СуммаДокумента = 0; 
	НоваяЗапись.Комментарий = "Заказ-наряд создан через мобильное приложение";
	Для Каждого СтруктураУслуги Из ДанныеЗапроса.МассивУслуг Цикл
		НоваяУслуга = НоваяЗапись.Услуги.Добавить();
		НоваяУслуга.Услуга  = Справочники.Номенклатура.НайтиПоНаименованию(СтруктураУслуги.Номенклатура);
		НоваяУслуга.Количество = Число(СтруктураУслуги.Количество);
		НоваяУслуга.Сумма = Число(СтруктураУслуги.Сумма);
		НоваяУслуга.Цена = СтруктураУслуги.Сумма / СтруктураУслуги.Количество;
		НоваяЗапись.СуммаДокумента = НоваяЗапись.СуммаДокумента + Число(СтруктураУслуги.Сумма);;
	КонецЦикла; 

	
	Попытка
		НоваяЗапись.Записать(РежимЗаписиДокумента.Проведение);
		ТекстОтвета = "Создан и проведен документ " + НоваяЗапись.Номер;
		Ответ = Новый HTTPСервисОтвет(200);
	Исключение
		НоваяЗапись.Записать();
		Ответ = Новый HTTPСервисОтвет(500);
		ТекстОтвета = "Произошла ошибка при проведении документа " + НоваяЗапись.Номер + "! ";
	КонецПопытки;
	
	Ответ.УстановитьТелоИзСтроки(ТекстОтвета);
	
	Возврат Ответ; 
	
КонецФункции
